import '../../models/content.dart';

const List<Content> recipes = [
Content(
    id:"sosiskivlave",
    title: "Сосиски в лаваше с сыром на сковороде",
    description: "Сырная основа в лаваше расплавляется и окутывает сосиску, а благодаря соусам лаваш становится более сочным и вкусным. Блюдо готовится буквально 20 минут, вы успеете накормить и родных, и неожиданно пришедших гостей",
    imagePath:"assets/images/sosiski_v_lavashe_s_sirom_na_skovorode.png",
    ingredients: ['сосиски — 5 шт.', 'лаваш — 2–3 листа', 'твёрдый сыр — 100 г', 'майонез — 2 ст. ложки', 'кетчуп — 2 ст. ложки', 'растительное масло — 40 мл.'],
    cookingSteps: [
        'Длинные листы лаваша нарежьте на части, чтобы в них удобно было завернуть сосиску.',
        'Смешайте майонез и кетчуп, смажьте лист лаваша.',
        'Натрите сыр и присыпьте лаваш.',
        'Выложите сосиску, заверните края лаваша и скатайте рулетиком.',
        'Обжарьте на сковороде с маслом по 1–2 минуты с каждой стороны до румяности (следите, чтобы лаваш не подгорел).']),
Content(
    id:"zolotayakasha",
    title:"Золотая каша",
    description: "Время приготовления пшена у разных производителей может отличаться, поэтому читайте инструкцию на упаковке. Состав овощей можете разнообразить по своему вкусу, можно добавить болгарский перчик желтого цвета, чеснок для аромата и сушеные ароматные травы.",
    imagePath: "assets/images/zolotaya_kasha.png",
    ingredients: ['пшено — 200 г', 'тыква — 200 г', 'репчатый лук — 1 шт.', 'морковь — 1 шт.', 'растительное масло — 2 ст. ложки', 'карри — 1 ч. ложка', 'соль, перец — по вкусу'],
    cookingSteps: [
        'сначала варят пшено (промывают и отваривают)',
        'отдельно обжаривают и тушат овощи (лук, морковь, тыква)',
        'затем соединяют готовую кашу с овощной начинкой',
        'добавляют карри, прогревают и подают']),
Content(
    id:"borsh",
    title: "Борщ со свеклой",
    description: "Свекла — главный герой этого блюда, которая придает борщу характерный цвет и невероятно полезные свойства. В сочетании с болгарским перцем, картофелем и морковью, так же нежной свининой, станет не только сытным, но и полезным блюдом для всей семьи. Подают его в горячем виде, со сметаной и свежей зеленью. И не забудьте подать к нему черный хлеб, который идеально дополнит его вкус.",
    imagePath: 'assets/images/borsh_so_svekloi.png',
    ingredients: ['вода (2 л)', 'свинина (300 г)', 'свёкла (2 шт.)', 'картофель (2 шт.)', 'соль', 'сахар'],
    cookingSteps: [
        'сначала варят бульон со свининой и одной свёклой',
        'затем мясо достают, бульон процеживают, в нём тушат оставшуюся свёклу с другими овощами.'])
];